/*
**********************************************************************************
** 文件说明：MMA8452加速度芯片操作                                                       
** 文件名称：Acceleration.h                                                 
** 创建日期：2013.05                                                         
** 创 建 人：XZY                                                                  
**---------------------------------------------------------------------------------*
** 修改日期：                                                                    
** 修改说明：                                                                    
***********************************************************************************/

#ifndef ACCELERATION_H
#define ACCELERATION_H

#include "pin_define.h"
#include "user_cfg.H"
#include "user_type.h"

//-------------------------------------------------------------------------------------
//说明：寄存器定义
//-------------------------------------------------------------------------------------
#define STATUS_00_REG	0x00	//数据就绪标志寄存器
#define XYZ_DATA_CFG	0x0E	//
#define CTRL_REG1		0x2A	//系统控制寄存器
#define CTRL_REG2		0x2B
#define CTRL_REG3		0x2C
#define CTRL_REG4       0x2D	//中断控制器
#define CTRL_REG5		0x2E


#define OUT_X_MSB		0x01
#define OUT_X_LSB		0x02
#define OUT_Y_MSB		0x03
#define OUT_Y_LSB		0x04
#define OUT_Z_MSB		0x05
#define OUT_Z_LSB		0x06

//-------------------------------------------------------------------------------------
//说明：定义
//-------------------------------------------------------------------------------------
#define ACTIVE_MASK		0x01	//活跃标志

#define FS_MASK			0x03
#define FULL_SCALE_2G	0x00
#define FULL_SCALE_4G	0x01
#define FULL_SCALE_8G	0x02

#define FREAD_MASK		0x02	//快读模式
#define DR_MASK			0x38	//数据输出速率
#define DataRateValue	0x00	//1.25ms
/*DataRateValue		输出数据速率		周期 
		0x00			800 Hz			1.25 ms
		0x01			400 Hz			2.5 ms
		0x02			200 Hz			5 ms
		0x03			100 Hz			10 ms
		0x04			50 Hz			20 ms
		0x05			12.5 Hz			80 ms
		0x06			6.25 Hz			160 ms
		0x07			1.56 Hz			640 ms
*/

#define INT_EN_DRDY		0x01	//数据就绪中断
#define INT_CFG_DRDY	0x01	//数据就绪中断信号连接到INT1引脚
/*
*****************************************************************************
** 函 数 名: void MMA8452_Active(void)
** 功能描述: MMA8452进正常工作模式
** 输　  入: 无
** 输　  出: 无
** 全局变量: 无
** 调用模块: 无
** 作　  者: xzy
** 日　  期: 2013.
*****************************************************************************
*/
extern void MMA8452_Active(void);
/*
*****************************************************************************
** 函 数 名: void ACCEL_OFF(void)
** 功能描述: 关闭加速度模块
** 输　  入: 无
** 输　  出: 无
** 全局变量: 无
** 调用模块: 无
** 作　  者: xzy
** 日　  期: 2013.
*****************************************************************************
*/
extern void ACCEL_OFF(void);
/*
*****************************************************************************
** 函 数 名: void ACCEL_Init(void)
** 功能描述: 加速度初始化
** 输　  入: 无
** 输　  出: TRUER/FALSE 
** 全局变量: 无
** 调用模块: 无
** 作　  者: xzy
** 日　  期: 2013.
*****************************************************************************
*/ 
extern void ACCEL_Init(void);

#endif