/*
**********************************************************************************
**文件说明：磁盘操作头文件                                                           
**文件名称：diskio.h                                                     
**创建日期：2013.05                                                         
**创 建 人：XZY                                                                   
**---------------------------------------------------------------------------------*
**修改日期：                                                                       
**修改说明：                                                                       
**********************************************************************************
*/
#ifndef DISKIO_H
#define DISKIO_H
#include "user_type.h"

/***********************************************************************************/
/*函数名称：Uint8 DISK_Read(Uint16 Addr,Uint8 * Buf,Uint16 Count)                   */
/*函数功能：从存储器中读取数据                                                     */
/*入口参数：Addr Buf Count                                                         */
/*返回参数：TRUER/FALSE                                                            */
/***********************************************************************************/
extern Bool DISK_Read(Uint16 Addr,Uint8 * Buf,Uint16 Count);//reentrant;

/***********************************************************************************/
/*函数名称：Uint8 DISK_Write(Uint16 Addr,Uint8 * Buf,Uint16 Count)                  */
/*函数功能：向存储器中写入数据                                                     */
/*入口参数：Addr Buf Count                                                         */
/*返回参数：TRUER/FALSE                                                            */
/***********************************************************************************/
extern Bool DISK_Write(Uint16 Addr,Uint8 * Buf,Uint16 Count);

/***********************************************************************************/
/*函数名称：void DISK_Init(void)                                                   */
/*函数功能：存储器初始化                                                           */
/*入口参数：无                                                                     */
/*返回参数：无                                                                     */
/***********************************************************************************/
//extern void DISK_Init(void);


#endif