/***********************************************************************************/
/*文件说明：内存分配管理头文件                                                     */
/*文件名称：memory.h                                                               */
/*创建日期：2013.04                                                             */
/*创 建 人：xzy                                                                   */
/*---------------------------------------------------------------------------------*/
/*修改日期：                                                                       */
/*修改说明：                                                                       */
/***********************************************************************************/
#ifndef MEMORY_H
#define MEMORY_H

#include "user_cfg.h"
#include "user_type.h"

extern code Uint16 BakDeviceNo;
extern code Uint8  BakIp[4];
extern code Uint16 BakPort;
// gather 采集
extern bit	dataReady;          //数据采集完成标志
// message
extern bit	msgReady;
extern bit	isDisposingCom;
extern bit	flagResend;
extern bit	centerAnswer;
//GPRS连接
extern bit 	Signal_OK;
extern bit 	RECEIVE_FLAG;
extern bit	PADDING_Flag;
extern bit	PPP_Rec_Complete;
extern bit	Flag_NetOk;
extern bit	PPP_First_Receive;
extern bit	EXCH_SEND4_Flag;
extern bit	WAVE_Data_Receive;
extern bit	UDP_Received;
//ZigBee 连接
extern bit	ZB_Rce_Complete;
extern bit	ZB_Rce_Flag;
//---------------------------------------------------------------------------------
//说明：系统状态数据
//---------------------------------------------------------------------------------
extern idata SYS_MODEDATA SysDat;
//-----------------------------------------------------------------------------------
//说明： 指针
//-----------------------------------------------------------------------------------
extern idata BUF_DATP BufDat;
extern idata GATHER_DATP GatDat;
extern idata LINK_DATP LinkDat;
//---------------------------------------------------------------------------------
//说明：XRAM数据引用声明
//---------------------------------------------------------------------------------
extern xdata Uint8 XGDat[];

extern xdata PARAMETER ParDat;
//---------------------------------------------------------------------------------
//说明：缓存数据
//---------------------------------------------------------------------------------
//extern xdata BUF_DAT BufDat;
//---------------------------------------------------------------------------------
//说明：信息发送结构
//---------------------------------------------------------------------------------
extern xdata MESSAGE_DATA Msg;

//---------------------------------------------------------------------------------
//说明：间接寻址内部数据存储器数据
//---------------------------------------------------------------------------------
//extern idata Uint8 IGDat[];

//extern idata ALL_DATA_POINT ADP;



//---------------------------------------------------------------------------------
//说明：直接寻址内部存储器数据
//---------------------------------------------------------------------------------
//extern data Uint8 DGDat[];


/***********************************************************************************/
/*函数名称：void MEM_cpy(Uint8 * dest,Uint8 * src,Uint8 count)                     */
/*函数功能：由src所指内存区域复制count个字节到dest所指内存区域                     */
/*入口参数：dest 目标地址                                                          */
/*          src 源地址                                                             */
/*          Uint8 count 复制长度                                                   */
/*返回参数：无                                                                     */
/***********************************************************************************/
extern void MEM_cpy(Uint8 * dest,Uint8 * src,Uint16 count) ;

/***********************************************************************************/
/*函数名称：Bit MEM_cmp(Uint8 * buf1,Uint8 * buf2,Uint8 count)                     */
/*函数功能：比较内存区域buf1和buf2的前count个字节是否相同                          */
/*入口参数：buf1 buf2 count                                                        */
/*返回参数：相等为0 不等为1                                                        */
/***********************************************************************************/
extern Bool MEM_cmp(Uint8 * buf1,Uint8 * buf2,Uint8 count);

/***********************************************************************************/
/*函数名称：MEM_set(Uint8 *buffer,Uint8 c,Uint8 count)                             */
/*函数功能：把buffer所指内存区域的前count个字节设置成字符c。                       */
/*入口参数：buffer c count                                                         */
/*返回参数：无                                                                     */
/***********************************************************************************/
extern void MEM_set(Uint8 *buffer,Uint8 c,Uint16 count)reentrant;


 #endif