/*
**********************************************************************************
**文件说明：ZigBee.h                                                            
**文件名称：ZigBee操作                                                     
**创建日期：2013.                                                         
**创 建 人：XZY                                                                   
**---------------------------------------------------------------------------------*
**修改日期：                                                                       
**修改说明：                                                                       
**********************************************************************************
*/
#ifndef ZIGBEE_H
#define ZIGBEE_H

#define COORDINATOR	0			// 协调器
#define ROUTER		1			// 路由
#define ENDDEVICE	2			// 终端节点

#define TRANSPARENT_MODE	0	//透传模式
#define AT_MODE				1	//AT 命令模式
#define API_MODE			2	//API 模式   

#define API_STAR	0xFE		//API模式数据帧头


/*
*****************************************************************************
**函 数 名：ZigBeeSend(Uint8 *p,Uint16 data_len);
**功能描述：ZigBee模块发送数据
**输    入：Uint8 *p,Uint16 data_len 
**输    出：
*****************************************************************************
*/
extern void ZigBeeSend(Uint8 *p,Uint16 data_len);
/*
*****************************************************************************
** 函 数 名: void ZigBeeInit(void)
** 功能描述: ZigBee模块初始化
** 输　  入: 无
** 输　  出: 无
** 全局变量: 无
** 调用模块: 无
** 作　  者: xzy
** 日　  期: 2013.
*****************************************************************************
*/ 
extern void ZigBeeInit(void);

#endif