/***********************************************************************************
**文件说明： C8051F单片机模拟I2C软件包文件                                                         
**文件名称： IIC.c                                                   
**创建日期：2013.                                                         
**创 建 人：XZY                                                                   
**---------------------------------------------------------------------------------*
**修改日期：                                                                       
**修改说明：                                                                       
***********************************************************************************/
#include <intrins.h>
#include "pin_define.h"
#include "user_type.h"

#define _Nop() _nop_()
Bool ack;	         	/*应答标志位*/

/*
*************************************************************************************
**函数名称：起动总线函数                                                           **
**函数功能：启动I2C总线,即发送I2C起始条件.                                         **
**入口参数：无                                                                     **
**返回参数：无                                                                     **
*************************************************************************************
*/
void Start_I2c(void)
{
    SDA=1;   	/*发送起始条件的数据信号*/
    _Nop();
    SCL=1;
    _Nop();    	/*起始条件建立时间大于4.7us,延时*/
    _Nop();
    _Nop();
    _Nop();
    _Nop();
	_Nop();    
    SDA=0;   	/*发送起始信号*/
    _Nop();    	/* 起始条件锁定时间大于4μs*/
    _Nop();
    _Nop();
    _Nop();
    _Nop(); 
	_Nop();      
    SCL=0;   	/*钳住I2C总线，准备发送或接收数据 */
    _Nop();
    _Nop();
}

/*
*************************************************************************************
**函数名称：结束总线函数                                                           **
**函数功能：结束I2C总线,即发送I2C结束条件.                                         **
**入口参数：无                                                                     **
**返回参数：无                                                                     **
*************************************************************************************
*/
void Stop_I2c(void)
{
    SDA=0;  	/*发送结束条件的数据信号*/
    _Nop();   	/*发送结束条件的时钟信号*/
    SCL=1;  	/*结束条件建立时间大于4μs*/
    _Nop();
    _Nop();
    _Nop();
    _Nop();
    _Nop();
	_Nop();
    SDA=1;  	/*发送I2C总线结束信号*/
    _Nop();
    _Nop();
    _Nop();
    _Nop();
}
/*
*************************************************************************************
**函数名称：发送单字节函数                                                         **
**函数功能：将数据c发送出去,可以是地址,也可以是数据,发完后等待应答,并对            **
**          此状态位进行操作.(不应答或非应答都使ack=0)                             **
**入口参数：Uint8 c发送数据                                                        **
**返回参数：无                                                                     **
*************************************************************************************
*/
void  SendByte(Uint8 c)
{
    Uint8 BitCnt;
 
    for(BitCnt=0;BitCnt<8;BitCnt++){  /*要传送的数据长度为8位*/
        if((c<<BitCnt)&0x80)SDA=1;   /*判断发送位*/
        else  SDA=0;                
        _Nop();
        SCL=1;               /*置时钟线为高，通知被控器开始接收数据位*/
        _Nop(); 
        _Nop();             /*保证时钟高电平周期大于0.6μs*/
        _Nop();
        _Nop();
        _Nop(); 
		_Nop(); 
		_Nop();
		_Nop();
		_Nop();
		_Nop();      
        SCL=0; 
    }
    _Nop();
    _Nop();
    SDA=1;                /*8位发送完后释放数据线，准备接收应答位*/
    _Nop();
    _Nop();   
    SCL=1;
    _Nop();
    _Nop();
    _Nop();
    if(SDA==1)ack=0;     
       else ack=1;        /*判断是否接收到应答信号*/
    SCL=0;
    _Nop();
    _Nop();
}

/*
*************************************************************************************
**函数名称：接收单字节函数                                                         **
**函数功能：用来接收从器件传来的数据,并判断总线错误(不发应答信号)，				   **
**          发完后请用应答函数应答从机。                                           **
**入口参数：无                                                                     **
**返回参数：无                                                                     **
*************************************************************************************
*/	
Uint8  RcvByte(void)
{
    Uint8 retc;
    Uint8 BitCnt;
  
    retc=0; 
    SDA=1;             		/*置数据线为输入方式*/
    for(BitCnt=0;BitCnt<8;BitCnt++){
        _Nop();           
        SCL=0;                  /*置时钟线为低，准备接收数据位*/
        _Nop();
        _Nop();                 /*时钟低电平周期大于4.7μs*/
        _Nop();
        _Nop();
        _Nop();
		_Nop();
        SCL=1;                  /*置时钟线为高使数据线上数据有效*/
        _Nop();
        _Nop();
		_Nop();
        retc=retc<<1;
        if(SDA==1)retc=retc+1;  /*读数据位,接收的数据位放入retc中 */
        _Nop();
        _Nop(); 
    }
    SCL=0;    
    _Nop();
    _Nop();
    return(retc);
}



/*
*************************************************************************************
**函数名称：应答子函数                                                             **
**函数功能：主控器进行应答信号(可以是应答或非应答信号，由位参数a决定)              **
**入口参数：无                                                                     **
**返回参数：无                                                                     **
*************************************************************************************
*/
void Ack_I2c(Uint8 a)reentrant
{
  
    if(a==0)SDA=0;     	     /*在此发出应答或非应答信号 */
        else SDA=1;
    _Nop();
    _Nop();
    _Nop();      
    SCL=1;
    _Nop();
    _Nop();                    /*时钟低电平周期大于4μs*/
    _Nop();
    _Nop();
    _Nop(); 
	_Nop(); 
    SCL=0;                     /*清时钟线，钳住I2C总线以便继续接收*/
    _Nop();
    _Nop();    
}

/*
*************************************************************************************
**函数名称：向有子地址器件发送多字节数据函数                                       **
**函数功能：从启动总线到发送地址，子地址,数据，结束总线的全过程,从器件             **
**          地址sla，子地址suba，发送内容是s指向的内容，p发送子地址				   **
**          8位或16位选择，发送no个字节。                                          **
**          如果返回1表示操作成功，否则操作有误。                                  **
**注意：    使用前必须已结束总线。                                                 **
**入口参数：...                                                                    **
**返回参数：成功/失败                                                              **
*************************************************************************************
*/
Bool ISendStr(Uint8 sla,Uint16 suba,Uint8 * s,Uint16 no,Uint8 p)reentrant
{
    Uint16 i;

    Start_I2c();                /*启动总线*/
    SendByte(sla);              /*发送器件地址*/
    if(ack==0)return(0);
    if(p){                       /*发送子地址*/
        SendByte(suba/256);        
        if(ack==0)return(0);
        SendByte(suba%256); 
        if(ack==0)return(0);    
    }
    else{
        SendByte((Uint8) suba);
        if(ack==0)return(0);
    }
    for(i=0;i<no;i++){   
      SendByte(*s);            /*发送数据*/
      if(ack==0)return(0);
      s++;
    } 
    Stop_I2c();                /*结束总线*/ 
    return(1);
}

/*
*************************************************************************************
**函数名称：向有子地址器件读取多字节数据函数                                       **
**函数功能：从启动总线到发送地址，子地址,读数据，结束总线的全过程,从器件           **
**          地址sla，子地址suba，读出的内容放入s指向的存储区，p发送子地址          **
**          8位或16位选择，读no个字节。                                            **
**          如果返回1表示操作成功，否则操作有误。								   **
**注意：    使用前必须已结束总线。                                                 **
**入口参数：...                                                                    **
**返回参数：成功/失败                                                              **
*************************************************************************************
*/
Bool IRcvStr(Uint8 sla,Uint16 suba,Uint8 * s,Uint16 no,Uint8 p)reentrant 

{
    Uint16 i;

    Start_I2c();                    /*启动总线*/
    SendByte(sla);                  /*发送器件地址*/
    if(ack==0)return(0);
    if(p){                           /*发送子地址*/
        SendByte(suba/256);        
        if(ack==0)return(0);
        SendByte(suba%256); 
        if(ack==0)return(0);    
    }
    else{
        SendByte((Uint8) suba);
        if(ack==0)return(0);
    }

    Start_I2c();                    /*重新启动总线*/
    SendByte(sla+1);
    if(ack==0)return(0);
    for(i=0;i<no-1;i++){   
        *s=RcvByte();               /*发送数据*/
        Ack_I2c(0);                 /*发送应答位*/  
        s++;
    } 
    *s=RcvByte();
    Ack_I2c(1);                     /*发送非应位*/
    Stop_I2c();                     /*结束总线*/ 
    return(1);
}

/*******************************************************************
                    向无子地址器件发送多字节数据函数               
函数原型: bit  ISendStrExt(uchar sla,uchar *s,uchar no);  
功能:     从启动总线到发送地址，子地址,数据，结束总线的全过程,从器件
          地址sla，发送内容是s指向的内容，发送no个字节。
          如果返回1表示操作成功，否则操作有误。
注意：    使用前必须已结束总线。
********************************************************************/
/*Bool ISendStrExt(Uint8 sla,Uint8 *s,Uint8 no) 
{
   Uint8 i;

   Start_I2c();               //启动总线
   SendByte(sla);             //发送器件地址
   if(ack==0)return(0);

   for(i=0;i<no;i++)
   {   
     SendByte(*s);            //发送数据
     if(ack==0)return(0);
     s++;
   } 
   Stop_I2c();                //结束总线
   return(1);
}*/


//---------------------------------------------------------------------------------
//说明： END
//---------------------------------------------------------------------------------
