/***********************************************************************************/
/*文件说明：内存相关管理                                                           */
/*文件名称：memory.c                                                               */
/*创建日期：2013.04                                                             */
/*创 建 人：xzy                                                                   */
/*---------------------------------------------------------------------------------*/
/*修改日期：                                                                       */
/*修改说明：                                                                       */
/***********************************************************************************/
#include "user_type.h"
//#include "user_cfg.h"

code Uint16 BakDeviceNo = 4003;
code Uint8  BakIp[4] = {218,58,191,90};
//code Uint16 BakPort  = 7100;
code Uint16 BakPort  = 6000;
// gather 采集
bit		dataReady;          //数据采集完成标志
// message
bit		msgReady;
bit		isDisposingCom;
bit		flagResend;
bit		centerAnswer;
//GPRS连接
bit 	Signal_OK;
bit 	RECEIVE_FLAG;
bit		PADDING_Flag;
bit		PPP_Rec_Complete;
bit		Flag_NetOk;
bit		PPP_First_Receive;
bit		EXCH_SEND4_Flag;
bit		WAVE_Data_Receive;
bit		UDP_Received;
//ZigBee 连接
bit		ZB_Rce_Complete;
bit		ZB_Rce_Flag;
//---------------------------------------------------------------------------------
//说明：系统状态数据
//---------------------------------------------------------------------------------
idata SYS_MODEDATA SysDat;
//-----------------------------------------------------------------------------------
//说明： 指针
//-----------------------------------------------------------------------------------
idata BUF_DATP BufDat;
idata GATHER_DATP GatDat;
idata LINK_DATP LinkDat;
//---------------------------------------------------------------------------------
//说明：XRAM数据
//---------------------------------------------------------------------------------
xdata Uint8 XGDat[XRAM_SIZE];     //1480
//-----------------------------------------------------------------------------------
//说明：参数
//-----------------------------------------------------------------------------------
xdata PARAMETER ParDat;           // 16
//---------------------------------------------------------------------------------
//说明：缓存数据
//---------------------------------------------------------------------------------
//xdata BUF_DAT BufDat;             //66
//---------------------------------------------------------------------------------
//说明：信息发送结构
//---------------------------------------------------------------------------------
xdata MESSAGE_DATA Msg;           //275
//
//xdata IP_PORT IpPort;
//---------------------------------------------------------------------------------
//说明：GPS串口接受缓存
//---------------------------------------------------------------------------------
//xdata Uint8 RcvBuf[GPSL] _at_ 0x12c;
//idata Uint8 * RcvBuf;

//---------------------------------------------------------------------------------
//说明：间接寻址内部数据存储器数据
//---------------------------------------------------------------------------------
//idata Uint8 IGDat[IRAM_SIZE];
//---------------------------------------------------------------------------------
//说明：参数指针集合
//---------------------------------------------------------------------------------
//idata ALL_DATA_POINT ADP;


//---------------------------------------------------------------------------------
//说明：直接寻址内部存储器数据
//---------------------------------------------------------------------------------
//data Uint8 DGDat[6]      ;//_at_ DATA_ADDR + 0;


/***********************************************************************************/
/*函数名称：void MEM_cpy(Uint8 * dest,Uint8 * src,Uint8 count)                     */
/*函数功能：由src所指内存区域复制count个字节到dest所指内存区域                     */
/*入口参数：dest 目标地址                                                          */
/*          src 源地址                                                             */
/*          Uint16 count 复制长度                                                   */
/*返回参数：无                                                                     */
/***********************************************************************************/
void MEM_cpy(Uint8 * dest,Uint8 * src,Uint16 count)
{
	//ClearMask(AUXR,EXTRAM);
	while(count != 0)
	{
		* dest = * src;
		dest ++;
		src ++;
		count --;
	}
}

/***********************************************************************************/
/*函数名称：Bool MEM_cmp(Uint8 * buf1,Uint8 * buf2,Uint8 count)                    */
/*函数功能：比较内存区域buf1和buf2的前count个字节是否相同                          */
/*入口参数：buf1 buf2 count                                                        */
/*返回参数：相等为TRUER 不等为FALSE                                                */
/***********************************************************************************/
Bool MEM_cmp(Uint8 * buf1,Uint8 * buf2,Uint8 count)
{
//	ClearMask(AUXR,EXTRAM);
	while(count != 0)
	{
		if(* buf1 != * buf2)
			return FALSE;
		buf1 ++;
		buf2 ++;
		count --;
	}
	return TRUER;
}

/***********************************************************************************/
/*函数名称：MEM_set(Uint8 *buffer,Uint8 c,Uint8 count)                             */
/*函数功能：把buffer所指内存区域的前count个字节设置成字符c。                       */
/*入口参数：buffer c count                                                         */
/*返回参数：无                                                                     */
/***********************************************************************************/
void MEM_set(Uint8 *buffer,Uint8 c,Uint16 count) reentrant
{
//	ClearMask(AUXR,EXTRAM);
	while(count !=0)
	{
		* buffer = c;
		buffer ++;
		count --;
	}
}























